## Terraform Plan

```
Acquiring state lock. This may take a few moments...
data.aws_availability_zones.azs: Reading...
data.aws_ami.ubuntu: Reading...
aws_route_table.public: Refreshing state... [id=rtb-0cdbb27a2a3412f64]
aws_security_group.k3s: Refreshing state... [id=sg-085440d2ce47e0c39]
data.aws_availability_zones.azs: Read complete after 0s [id=ap-southeast-1]
aws_subnet.private: Refreshing state... [id=subnet-0514f816da0e430a0]
aws_subnet.public: Refreshing state... [id=subnet-0ae3747db1aaefebd]
data.aws_ami.ubuntu: Read complete after 1s [id=ami-0c1d28734eb221b6d]
aws_instance.k3s: Refreshing state... [id=i-0156de0a4ca0738f1]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-068fa44414437f3f7]
aws_eip.k3s: Refreshing state... [id=eipalloc-09acd165292cc8788]
local_file.ansible_inventory: Refreshing state... [id=35fac3ab1eb3faf43f6ef902e08ed58e1b52c6c9]
null_resource.show_pwd: Refreshing state... [id=2923969834001703611]
null_resource.wait_ssh: Refreshing state... [id=365215023281443318]
null_resource.ansible: Refreshing state... [id=3800611308858957684]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.k3s will be updated in-place
  ~ resource "aws_eip" "k3s" {
        id                       = "eipalloc-09acd165292cc8788"
      ~ instance                 = "i-0156de0a4ca0738f1" -> (known after apply)
        tags                     = {}
        # (17 unchanged attributes hidden)
    }

  # aws_instance.k3s must be replaced
-/+ resource "aws_instance" "k3s" {
      ~ ami                                  = "ami-0c687e8f5c4e54af5" -> "ami-0c1d28734eb221b6d" # forces replacement
      ~ arn                                  = "arn:aws:ec2:ap-southeast-1:131234316164:instance/i-0156de0a4ca0738f1" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "ap-southeast-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ iam_instance_profile                 = "EC2-S3-Role" -> (known after apply)
      ~ id                                   = "i-0156de0a4ca0738f1" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-06dc99663c61ec21b" -> (known after apply)
      ~ private_dns                          = "ip-172-31-17-21.ap-southeast-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "172.31.17.21" -> (known after apply)
      ~ public_dns                           = "ec2-18-140-49-89.ap-southeast-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "18.140.49.89" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
          - "k3s-demo-20260203124732605400000002",
        ] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "AutoStop" = "true"
            "Name"     = "k3s-demo"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (8 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ tags_all              = {} -> (known after apply)
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-08a9506bbcf37cd7d" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # local_file.ansible_inventory will be created
  + resource "local_file" "ansible_inventory" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./ansible/inventory.ini"
      + id                   = (known after apply)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```